app/Controllers/Tasks.php

    public function index()
    {
        $taskModel = new TaskModel();

        $tasks = $taskModel
            ->where('is_archived', 0)
            ->orderBy('task_date', 'ASC')
            ->findAll();
---
SELECT *
FROM `tasks`
WHERE `is_archived` = 0
ORDER BY `task_date` ASC

    public function edit($id)
    {
        $taskModel = new TaskModel();

        $task = $taskModel
            ->where('is_archived', 0)
            ->find($id);
---
SELECT *
FROM `tasks`
WHERE `is_archived` = 0
AND `tasks`.`id` = '9'

    public function update($id)
    {
        $taskModel = new TaskModel();

        $task = $taskModel
            ->where('is_archived', 0)
            ->find($id);

        if (!$task) {
            return redirect()->to('/tasks')
                ->with('error', 'Task not found.');
        }

        $rules = [
            'title' => 'required|max_length[150]',
            'task_date' => 'required|valid_date[Y-m-d]',
            'status' => 'required|in_list[pending,completed]'
        ];

        if (!$this->validate($rules)) {
            return redirect()->back()
                ->withInput()
                ->with('errors', $this->validator->getErrors());
        }

        $taskModel->update($id, [
            'title' => trim($this->request->getPost('title')),
            'task_date' => $this->request->getPost('task_date'),
            'status' => $this->request->getPost('status')
        ]);
---
SELECT *
FROM `tasks`
WHERE `is_archived` = 0
AND `tasks`.`id` = '9'
UPDATE `tasks` SET `title` = 'Minecraft Gameplay', `task_date` = '2026-12-25', `status` = 'completed'
WHERE `tasks`.`id` IN ('9')

    public function archive($id)
    {
        $taskModel = new TaskModel();

        $task = $taskModel
            ->where('is_archived', 0)
            ->find($id);

        if (!$task) {
            return redirect()->to('/tasks')
                ->with('error', 'Task not found.');
        }

        $taskModel->update($id, [
            'is_archived' => 1
        ]);
---
SELECT *
FROM `tasks`
WHERE `is_archived` = 0
AND `tasks`.`id` = '8'
UPDATE `tasks` SET `is_archived` = 1
WHERE `tasks`.`id` IN ('8')